{
    "voc_summary": [
        {
            "month": "2025년 1월",
            "issues": [
                {
                    "category": "하드웨어 불량 (태블릿/부자재)",
                    "title": "주요 문의 내용",
                    "content": "태블릿 전원이 안 켜지거나, 부팅 중 멈춤 현상이 발생해요. 카드 리더기 연결이 안 되거나 결제 시 오류(9990)가 발생합니다. C to C 타입 케이블 및 거치대 불량이 잦아요.",
                    "solution": "- 태블릿 재부팅 및 배터리, 케이블 재연결<br>- 불량 케이블 및 리더기, 거치대 교체<br>- 기기 공장 초기화 및 리퍼 단말로 교체"
                },
                {
                    "category": "POS 연동 및 시스템",
                    "title": "주요 문의 내용",
                    "content": "POS 기기 교체 또는 재설치 후 주문 연동이 안돼요. 메뉴나 가격 동기화가 반영되지 않고, 주방 프린터로 주문서가 출력되지 않습니다.",
                    "solution": "- 하이오더 매니저 재설치 및 동기화<br>- POS 시스템 재부팅 및 방화벽 설정 확인<br>- 포트포워딩 재설정 및 POS 버전 업데이트 권고"
                },
                {
                    "category": "네트워크 (Wi-Fi) 문제",
                    "title": "주요 문의 내용",
                    "content": "매장 전체 또는 일부 태블릿의 와이파이 연결이 끊기거나 신호가 약해 주문이 어렵습니다.",
                    "solution": "- 와이파이 공유기 재부팅 및 재설정<br>- 태블릿 네트워크 설정 초기화<br>- AP(공유기) 점검 및 교체"
                },
                {
                    "category": "기능 및 설정 문의",
                    "title": "주요 문의 내용",
                    "content": "메뉴/옵션 추가 및 이미지 변경 방법을 알고 싶어요. 영수증 출력 설정을 변경하고 싶습니다. 알림판 기능 및 스크린 공지 사용법이 궁금합니다.",
                    "solution": "- 관리자 페이지(어드민)에서 메뉴 및 이미지 수정<br>- 하이오더 매니저 환경설정에서 출력/알림 설정<br>- 기능별 매뉴얼 제공 및 원격 지원"
                }
            ]
        },
        {
            "month": "2025년 2월",
            "issues": [
                {
                    "category": "POS 연동 및 시스템",
                    "title": "주요 문의 내용",
                    "content": "POS 연동이 실패하거나 주문이 누락돼요. 결제 시 오류 메시지(SIGN FLAG, 9990)가 발생합니다. 주문서가 이중으로 출력되거나 아예 나오지 않는 문제가 있습니다.",
                    "solution": "- 하이오더 매니저 자동 실행 설정 및 재실행<br>- POS 프로그램 버전 확인 및 업데이트<br>- 결제 모듈 재설치 및 펌웨어 업데이트<br>- 메모리(RAM) 부족 시 포스 업그레이드 안내"
                },
                {
                    "category": "하드웨어 불량 (태블릿/부자재)",
                    "title": "주요 문의 내용",
                    "content": "태블릿이 KT 로고 화면에서 멈추거나 화면 터치가 안돼요 (고스트 터치). 케이블 접촉 불량으로 전원이 자꾸 꺼집니다.",
                    "solution": "- 불량 케이블(C to C 타입) 및 어댑터 교체<br>- 태블릿 캐시 삭제 및 공장 초기화<br>- 증상 지속 시 리퍼 단말로 교체 진행"
                },
                {
                    "category": "기능 및 설정 문의",
                    "title": "주요 문의 내용",
                    "content": "자동 퇴장 및 후불 결제 설정을 하고 싶어요. 대기화면의 광고를 삭제하고 싶습니다. 알림 소리 조절이나 특정 조건(현금)에서만 알림을 받고 싶어요.",
                    "solution": "- 하이오더 매니저 및 관리자 페이지에서 기능 설정<br>- 광고 미동의 처리 요청<br>- 기능 매뉴얼 제공 및 원격 지원"
                },
                {
                    "category": "네트워크 (Wi-Fi) 문제",
                    "title": "주요 문의 내용",
                    "content": "정전 이후 또는 특정 시간만 되면 와이파이 연결이 안 되고 네트워크 오류가 발생합니다.",
                    "solution": "- 와이파이 공유기 재부팅 및 점검<br>- 태블릿 비행기 모드 확인 및 네트워크 재설정"
                }
            ]
        },
        {
            "month": "2025년 3월",
            "issues": [
                {
                    "category": "POS 연동 및 시스템",
                    "title": "주요 문의 내용",
                    "content": "주문이 누락되거나 프린터로 출력되지 않아요. POS 프로그램 버전이 낮아 연동 오류가 발생하고, 'Pos Program is not running' 같은 오류 메시지가 뜹니다.",
                    "solution": "- 하이오더 매니저 재시작 및 동기화 진행<br>- POS 대리점을 통한 프로그램 버전 업데이트<br>- 포트포워딩 및 방화벽 설정 확인"
                },
                {
                    "category": "하드웨어 불량 (태블릿/부자재)",
                    "title": "주요 문의 내용",
                    "content": "태블릿 전원이 들어왔다 나갔다 반복돼요. 카드 리더기에 빨간 불이 들어오며 결제가 실패합니다.",
                    "solution": "- 전원 케이블 및 어댑터 불량 확인 및 교체<br>- 결제 리더기 점검 및 교체<br>- 결제 모듈 및 태블릿 버전 업데이트"
                },
                {
                    "category": "네트워크 (Wi-Fi) 문제",
                    "title": "주요 문의 내용",
                    "content": "전체 테이블에서 와이파이 연결이 안 되거나 특정 태블릿의 인터넷 연결이 계속 끊어집니다.",
                    "solution": "- 와이파이 공유기(AP) 위치 변경 및 재설정<br>- 네트워크 환경 점검 및 포트포워딩"
                },
                {
                    "category": "기타 서비스 요청",
                    "title": "주요 문의 내용",
                    "content": "사업자 정보가 변경되거나 매장을 이전하여 시스템 재설치가 필요합니다.",
                    "solution": "- 명의변경 및 이전설치에 따른 재연동 작업<br>- 네트워크 재구성 및 하이오더 매니저 재설치"
                }
            ]
        },
        {
            "month": "2025년 4월",
            "issues": [
                {
                    "category": "POS 연동 및 시스템",
                    "title": "주요 문의 내용",
                    "content": "POS 교체 또는 재설치 후 하이오더 연동이 안돼요. 주문서가 출력되지 않거나 결제가 POS에 반영되지 않는 오류가 발생합니다.",
                    "solution": "- 하이오더 매니저 프로그램 재설치 및 연동<br>- 포트포워딩 작업 및 네트워크 점검<br>- 비밀번호 오류 시 암호 변경 후 재시도"
                },
                {
                    "category": "하드웨어 불량 (태블릿/부자재)",
                    "title": "주요 문의 내용",
                    "content": "태블릿/알림판의 전원 및 부팅 불량이 잦고, 화면이 저절로 터치돼요(고스트터치). CC타입 강화케이블, 리더기, 거치대 등 부자재 교체 요청이 많습니다.",
                    "solution": "- 배터리 및 케이블(강화 케이블) 교체<br>- 고스트터치 발생 시 캐시 삭제 또는 공장 초기화<br>- 불량 부자재(리더기, 거치대) AS 교체"
                },
                {
                    "category": "네트워크 (Wi-Fi) 문제",
                    "title": "주요 문의 내용",
                    "content": "와이파이 신호가 약하거나 연결이 불량하여 주문이 안돼요. 공유기 설정 오류로 인터넷 사용이 불가합니다.",
                    "solution": "- 와이파이 신호 재설정 및 AP(공유기) 점검<br>- 네트워크 구성 오류 수정 및 재설정"
                },
                {
                    "category": "기능 및 설정 문의",
                    "title": "주요 문의 내용",
                    "content": "층별 주방 프린터 설정이나 메뉴 순서 변경 등 맞춤 설정이 필요해요. 관리자 비밀번호를 잊어버렸거나 로그인이 안됩니다.",
                    "solution": "- 관리자 페이지 또는 원격 지원을 통한 설정 변경<br>- 계정 정보 확인 및 비밀번호 재설정"
                }
            ]
        },
        {
            "month": "2025년 5월",
            "issues": [
                {
                    "category": "하드웨어 불량 (태블릿/부자재)",
                    "title": "주요 문의 내용",
                    "content": "태블릿 화면이 흰색/검은색으로 변하면서 먹통이 돼요. 케이블을 건드리면 전원이 꺼지거나, 리더기 불량으로 결제가 안됩니다. 거치대가 파손됐어요.",
                    "solution": "- 케이블, 리더기 등 불량 부자재 교체<br>- 태블릿 펌웨어 업데이트 및 앱 오류(캐시 지우기) 조치<br>- 증상 반복 시 리퍼 단말 교체"
                },
                {
                    "category": "POS 연동 및 시스템",
                    "title": "주요 문의 내용",
                    "content": "POS 기기를 변경하거나 재설치한 후 연동이 안돼요. 시스템이 전체적으로 느려지고 '응답하지 않음' 메시지가 자주 발생합니다.",
                    "solution": "- 변경된 POS 정보로 하이오더 연동 재설정<br>- 포트포워딩 및 방화벽 설정 확인<br>- CPU 사용량 확인 및 포스 리커버리 안내"
                },
                {
                    "category": "네트워크 (Wi-Fi) 문제",
                    "title": "주요 문의 내용",
                    "content": "Wi-Fi 신호가 불안정하고 자주 끊겨서 점검이 필요해요. 인터넷 속도가 느려 주문이 지연됩니다.",
                    "solution": "- 공유기 재부팅 및 초기화, 채널 변경<br>- 불필요한 Wi-Fi 설정 삭제 및 재연결<br>- 지속적인 문제 발생 시 공유기 점검 및 교체"
                },
                {
                    "category": "기능 및 설정 문의",
                    "title": "주요 문의 내용",
                    "content": "메뉴 숨김/노출, 순서 변경, 이미지 등록 방법을 알고 싶어요. 게임 기능 사용, 광고 차단, 호출 알림 설정 등 특정 기능 설정이 필요합니다.",
                    "solution": "- 관리자 페이지를 통한 메뉴 및 콘텐츠 관리<br>- 기능별 설정 방법 매뉴얼 제공<br>- 원격지원을 통한 맞춤 기능 설정"
                }
            ]
        },
        {
            "month": "2025년 6월",
            "issues": [
                {
                    "category": "하드웨어 불량 (태블릿/부자재)",
                    "title": "주요 문의 내용",
                    "content": "태블릿 전원/부팅 불량 및 케이블(C-타입 강화 케이블) 불량으로 인한 AS 요청이 많습니다.",
                    "solution": "- 불량 케이블 및 어댑터 교체 (신형 강화 케이블)<br>- 전원 불량 시 리퍼 단말 지참 후 방문 교체"
                },
                {
                    "category": "POS 연동 및 시스템",
                    "title": "주요 문의 내용",
                    "content": "POS와 하이오더 매니저 연동 오류가 잦아요. 프린터 출력이 안되거나 결제 시 오류(9990, 해지된 가맹점)가 발생합니다. POS 리커버리 후 재설치가 필요합니다.",
                    "solution": "- 하이오더 매니저 재설치 및 포트포워딩 작업<br>- POS 프로그램 버전 업데이트 권고<br>- 결제 모듈 재설치 및 VAN사 문의 안내"
                },
                {
                    "category": "네트워크 (Wi-Fi) 문제",
                    "title": "주요 문의 내용",
                    "content": "네트워크 연결이 계속 끊어지고 불안정해요. 매장 출근 후 여러 태블릿을 동시에 켜면 일부 기기에서 네트워크 연결이 안됩니다.",
                    "solution": "- 네트워크 장비(AP, 공유기) 재부팅 및 리셋<br>- Wi-Fi 신호 강도 및 커버리지 점검<br>- 문제 반복 시 공유기 교체 및 네트워크 재구성"
                },
                {
                    "category": "기능 및 설정 문의",
                    "title": "주요 문의 내용",
                    "content": "메뉴 옵션 동기화가 안되거나, 중복 선택 설정에 오류가 있어요. 광고 송출 중단을 요청했는데 계속 노출됩니다. 알림판 기능 개선이 필요해요.",
                    "solution": "- POS와 연동된 옵션 설정 재확인 및 동기화<br>- 관리자 페이지에서 광고 미동의 처리 및 재확인<br>- 기능 관련 피드백 전달 및 개선 요청"
                }
            ]
        },
        {
            "month": "2025년 7월",
            "issues": [
                {
                    "category": "하드웨어 불량 (태블릿/부자재)",
                    "title": "주요 문의 내용",
                    "content": "태블릿 전원/부팅 불량(C2C 케이블), 화면 불량(백화, 빛샘 현상), 리더기 불량(빨간불), 거치대 파손 등 하드웨어 관련 문제가 가장 많습니다.",
                    "solution": "- 불량 케이블(구형->신형) 및 리더기, 거치대 교체<br>- 화면 불량 및 기기 고장 시 리퍼 단말로 교체<br>- 시스템 초기화 및 재부팅"
                },
                {
                    "category": "POS 연동 및 시스템",
                    "title": "주요 문의 내용",
                    "content": "명의 변경, POS 교체 후 연동 오류가 발생해요. 주문서/영수증 출력이 안되거나 이중 결제, 결제 누락 등 민감한 문제가 발생했습니다.",
                    "solution": "- POS/명의 변경에 따른 정보 변경 및 재연동<br>- 프린터 및 결제 모듈 설정 확인<br>- POS 프로그램 버전 업데이트 및 방화벽 해제"
                },
                {
                    "category": "네트워크 (Wi-Fi) 문제",
                    "title": "주요 문의 내용",
                    "content": "와이파이 연결이 불안정하거나 끊겨요. 아침마다 공유기를 재부팅해야 하는 번거로움이 있습니다.",
                    "solution": "- 공유기 재부팅, 네트워크 초기화 및 재연결<br>- 공유기 위치 조정 및 점검/교체"
                },
                {
                    "category": "기능 및 설정 문의",
                    "title": "주요 문의 내용",
                    "content": "셀프픽업, 더치페이, 할인 기능 등 특정 기능에 대한 문의가 많습니다. 시스템에서 지원하지 않는 기능에 대한 요청도 있습니다.",
                    "solution": "- 지원 가능 기능에 대한 설정 및 매뉴얼 제공<br>- 미지원 기능에 대한 명확한 안내 및 대체 방안 제시<br>- 관리자 페이지를 통한 맞춤 설정 지원"
                }
            ]
        }
    ]
}
